# создайте класс Die с одним атрибутом sides, который имеет значение по 
# умолчанию 6. Напишите метод roll_die() для вывода случайного числа от 1 до количества 
# граней на кубике. Создайте экземпляр, представляющий 6-гранный кубик, и смоделируйте 
# 10 бросков.
# Создайте экземпляры, представляющие 10- и 20-гранный кубик. Смоделируйте 10 бросков 
# каждого кубика.

from lib.die import Die

my_die = Die(20)
for i in range(0,10):
    print(my_die.roll_die(), end='\t')