# создайте список или кортеж, содержащий серию из 10 чисел и 5 букв. 
# Слу-чайным образом выберите 4 числа или буквы из списка. 
# Выведите сообщение о том, что билет, содержащий эту комбинацию 
# из четырех цифр или букв, является выигрышным.

from lib.lottery import Lottery

my_lottery = Lottery()
print(f'Выигрышный билет: "{my_lottery.get_chance()}".')