# напишите цикл, который проверяет, насколько сложно выиграть 
#в смоделированной вами лотерее. Создайте список или кортеж с именем my_ticket. 
# Напишите цикл, который продолжает генерировать комбинации до тех пор, 
# пока не выпадет выигрышная комбинация. 
# Выведите сообщение с информацией о том, сколько выполнений 
# цикла понадобилось для получения выигрышной комбинации.

from lib.lottery import Lottery

let_repalses = True
my_lottery = Lottery()
win_ticket = my_lottery.get_chance(let_repalses)
print(f'Выигрышный билет: "{win_ticket}".')

i = 1
while win_ticket != my_lottery.get_chance(let_repalses):
    i += 1

print(f'Выигрышный билет попался с {i} попытки.')