# повторите упражнение 2.5, но на этот раз сохраните имя автора цитаты в переменной famous_person. 
# Затем составьте сообщение и сохраните его в новой переменной с именем message. 
# Выведите свое сообщение.
famous_person = 'Albert Einstein'
message = '"A person who never made\na mistake never tried anything new."'
print(f'{famous_person} once said, {message}')