# сохраните имя пользователя в переменной. 
# Добавьте в начале и в конце имени несколько пропусков.
# Проследите за тем, чтобы каждая служебная последовательность , "\t" и "\n", встречалась по крайней мере один раз.
# Выведите имя, чтобы были видны пропуски в начале и конце строки.
# Затем выведите его снова с использованием каждой из функций удаления пропусков: lstrip(), rstrip() и strip()

name = '  \n\tAlbert Einshtein\t\n\t '
print(f'str:"{name}"')
print(f'lstrip:"{name.lstrip()}"')
print(f'rstrip:"{name.rstrip()}"')
print(f'strip:"{name.strip()}"')