# напишите операции сложения, вычитания, умножения и деления, результатом которых является число 8.
# Не забудьте заключить операции в команды print(), чтобы проверить результат.
# Вы должны написать четыре строки кода, которые выглядят примерно так:
# print(5 + 3)
# Результатом должны быть четыре строки, в каждой из которых выводится число 8.
MY_CONST = 8
print(5 + 3)
print(1_000 - 99_2)
print(2 * 4) 
print(64 / MY_CONST) 

# интерпретатор не генерирует ошибку, нужно самому бать внимательным: 
#№ все буквы имени в верхнем регистре означает константу
MY_CONST = 6 