# сохраните свое любимое число в переменной.
# Затем при помощи переменной создайте сообщение для вывода этого числа.
# Выведите это сообщение.

my_favorite_digit = 2
message = f"My favorite digit is {my_favorite_digit}"
print(message)