# количество условий не ограничивается десятью. Попробуйте написать другие
#  условия и включить их в conditional_tests.py. Программа должна выдавать по 
# крайней мере один истинный и один ложный результат для следующих видов проверок:
# • Проверка равенства и неравенства строк.
# • Проверки с использованием функции lower().
# • Числовые проверки равенства и неравенства, условий «больше», «меньше», «боль-
#   ше или равно», «меньше или равно».
# • Проверки с ключевым словом and и or.
# • Проверка вхождения элемента в список.
# • Проверка отсутствия элемента в списке.