# представьте, что в вашей компьютерной игре только что был подбит корабль 
#пришельцев. Создайте переменную с именем alien_color и присвойте ей значение
#  'green', 'yellow' или 'red'.
# • Напишите команду if для проверки того, что переменная содержит значение 
#  'green'. Если условие истинно, выведите сообщение о том, что игрок только что 
#  заработал 5 очков.
# • Напишите одну версию программы, в которой условие if выполняется, и другую 
#  версию, в которой оно не выполняется. (Во второй версии никакое сообщение вы-
#  водиться не должно.)

alien_color = ''
c = ''
while 1:
    c = input('Введите 1, 2 или 3 (для завершения - Enter)')
    if c == '1':
        alien_color = 'зелёный'
    elif c == '2':
        alien_color = 'желтый'
    elif c == '3':
        alien_color = 'красный'
    else:
        break;
    if alien_color != '':
        print(f'Вы сбили {alien_color} вражеский корабль и заработали {int(c)*5} очков.')        
    