# сохраните имена нескольких своих друзей в списке с именем names.
# Выведите имя каждого друга, обратившись к каждому элементу списка (по одному за раз).

names = ['Alexandr', 'Pavel', 'Ilya', 'Artem']
for name in names:
    print(name)