# если ни в одной из предшествующих программ вы еще не сталкивались с ошибками индексирования,
# попробуйте создать такую ошибку искусственно. 
# Измените индекс в одной из программ, чтобы вызвать ошибку индексирования. 
# Не забудь те исправить ошибку перед тем, как закрывать программу.

# Итоги
# В этой главе вы узнали, что собой представляют списки и как работать с отдельны-
# ми элементами в списках. Вы научились определять списки, добавлять и удалять 
# элементы, выполнять сортировку (постоянную или временную для отображения). 
# Также вы узнали, как определить длину списка и как избежать ошибок индексиро-
# вания при работе со списком.
    