# если бы вы могли пригласить кого угодно (из живых или умерших) на обед, то кого бы вы пригласили?
# Создайте список, включающий минимум трех людей, которых вам хотелось бы пригласить на обед. 
# Затем используйте этот список для вывода пригласительного сообщения каждому участнику.

guests = ['Alexandr', 'Pavel', 'Ilya', 'Artem']
for guest in guests:
    print(f'{guest.title()}, I would like to invite you on my party at 10th november.')